# MaxValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageType..::..MaxValue Property
VoltageType Class See Also
---
Get upper boundary of voltage value of this voltage definition, the unit is volt.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double MaxValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaxValue As Double
	Get
```

Visual C++
---
```text
public:
property double MaxValue {
	double get ();
}
```

# See Also
VoltageType Class
Autodesk.Revit.DB.Electrical Namespace